[
  {
    "title": "Cygnus X-1, Book II: Hemispheres",
    "artist": "Rush",
    "description": "Rush—giants of progressive rock and ambassadors of music for their native Canada—perform the prelude to “Cygnus X-1, Book II: Hemispheres” (how’s that for a nerdy, prog rock song title?). This song deals with the conflict between the Apollonian and Dionysian ways of looking at the world as well as the ultimately moderate balance struck between the two extremes.  Unfortunately, this clip doesn’t contain the whole song; all the same, I strongly recommend that you seek out the tune in its entirety.  Listen, and be enthralled.",
    "mediaUrl": "https://www.youtube.com/watch?v=GrAl6QxHRb8"
  },
  {
    "title": "The Lyre of Orpheus",
    "artist": "Nick Cave & the Bad Seeds",
    "description": "We have Australian musician/author/screenwriter Nick Cave to thank for this interesting take on the myth of Orpheus and Eurydice. If you pay close attention to the lyrics, you’ll notice that they’re rather humorous, albeit in a macabre way. Nick Cave is famous not only for leading the Bad Seeds but also for fronting legendary Australian post-punk band, the Birthday Party (originally called the Boys Next Door).",
    "mediaUrl": "https://youtu.be/CFb8AoiwmDw"
  },
  {
    "title": "Ares",
    "artist": "Bloc Party",
    "description": "British rockers Bloc Party perform a song inspired by the Greek war god, Ares.",
    "mediaUrl": "https://www.youtube.com/watch?v=-Vr1PpGmcrc"
  },
  {
    "title": "The Flight of Icarus",
    "artist": "Iron Maiden",
    "description": "Iron Maiden—fronted by erstwhile fencing enthusiast Bruce Dickinson—wrote this tune about the unfortunate progeny of Daedalus. The song is awesome; the band members’ penchant for spandex . . . not so much.",
    "mediaUrl": "https://www.youtube.com/watch?v=oCg8zf7pcjY&feature=youtu.be"
  },
  {
    "title": "Achilles Last Stand",
    "artist": "Led Zeppelin",
    "description": "This is a classic cut from the 1976 Led Zeppelin album, Presence. It doesn’t need much introduction, as we’re all intimately familiar with Achilles and the carnage he wrought beneath the walls of Ilion.",
    "mediaUrl": "https://www.youtube.com/watch?v=YWOuzYvksRw"
  },
  {
    "title": "The Fountain of Salmacis",
    "artist": "Genesis",
    "description": "English progressive rock band Genesis perform “The Fountain of Salmacis,” a song about a famous nymph described in Ovid’s Metamorphoses. If you look (or listen) closely, you may notice that the band is fronted by a young Peter Gabriel, with a noticeably not bald Phil Collins behind the drum kit.",
    "mediaUrl": "https://www.youtube.com/watch?v=orSrE8yowQk"
  }
]
